In [3]:
import pandas as pd
import sqlite3

con = sqlite3.connect('dados.db')
df = pd.read_sql('SELECT * FROM dim_usuarios LIMIT 5', con)
display(df)
con.close()

,user_id,cpf,e-mail,entry_date,entry_time,name,update_date
0,user_10,89333325563,cliente10@exemplo.com,2023-11-03,03:10:00,Cliente 10,2023-05-23
1,user_100,80858959841,cliente100@exemplo.com,2023-04-18,03:59:25,Cliente 100,2023-01-08
2,user_1000,25178732742,cliente1000@exemplo.com,2023-07-31,22:16:47,Cliente 1000,2023-05-24
3,user_101,46762409450,cliente101@exemplo.com,2023-04-14,09:22:00,Cliente 101,2023-02-20
4,user_102,25473014829,cliente102@exemplo.com,2023-10-21,02:38:00,Cliente 102,2023-02-07

In [8]:
#✅ 1. Total de pedidos por mês
import sqlite3

# Conectar ao banco
con = sqlite3.connect('dados.db')
cur = con.cursor()

# Criar view corretamente
cur.execute("""
    CREATE VIEW IF NOT EXISTS total_pedidos_por_mes AS
    SELECT 
        strftime('%Y-%m', created_at) AS mes,
        COUNT(DISTINCT order_id) AS total_pedidos
    FROM fato_pedidos
    GROUP BY mes;
""")

# Confirmar e fechar
con.commit()
con.close()

print("View 'total_pedidos_por_mes' criada com sucesso.")

View 'total_pedidos_por_mes' criada com sucesso.

In [10]:
import sqlite3

con = sqlite3.connect('dados.db')
cur = con.cursor()

# Listar tabelas
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
tabelas = cur.fetchall()

# Exibir
for tabela in tabelas:
    print(tabela[0])

con.close()

dim_usuarios
fato_pedidos
dim_produtos

In [12]:
import sqlite3

con = sqlite3.connect('dados.db')
cur = con.cursor()

# Listar todas as views
cur.execute("SELECT name FROM sqlite_master WHERE type='view';")
views = cur.fetchall()

# Exibir
for view in views:
    print(view[0])

con.close()

total_pedidos_por_mes

In [16]:
import sqlite3

con = sqlite3.connect('dados.db')
cur = con.cursor()

cur.execute("DROP VIEW IF EXISTS total_pedidos_por_mes;")

cur.execute("""
    CREATE VIEW total_pedidos_por_mes AS
    SELECT 
        strftime('%Y-%m', created_at) AS mes,
        COUNT(DISTINCT order_id) AS total_pedidos
    FROM fato_pedidos
    GROUP BY mes;
""")

con.commit()
con.close()

In [22]:
import pandas as pd
import sqlite3

con = sqlite3.connect('dados.db')
df = pd.read_sql("""
    SELECT 
    mes as ano_mes,
    total_pedidos           
    FROM total_pedidos_por_mes
    ORDER BY total_pedidos DESC
""", con)
con.close()

display(df)

    ano_mes  total_pedidos
0   2023-07             33
1   2023-05             30
2   2023-06             30
3   2023-08             30
4   2023-02             25
5   2023-11             24
6   2023-12             24
7   2023-01             23
8   2023-03             23
9   2023-04             22
10  2023-09             20
11  2023-10             16

In [24]:
import sqlite3

con = sqlite3.connect('dados.db')
cur = con.cursor()

cur.execute("DROP VIEW IF EXISTS receita_por_metodo_pagamento;")

cur.execute("""
    CREATE VIEW receita_por_metodo_pagamento AS
  SELECT 
    payment_method,
    SUM(total) AS receita_total
FROM fato_pedidos
GROUP BY payment_method;
""")

con.commit()
con.close()

In [25]:
con = sqlite3.connect('dados.db')
df = pd.read_sql("""
    SELECT 
    *      
    FROM receita_por_metodo_pagamento
""", con)
con.close()

display(df)

  payment_method  receita_total
0           None     78246545.0
1         boleto      8552491.0
2        crédito      7109102.0
3       dinheiro     10210131.0
4         débito      6367515.0
5            pix     10563267.0

In [26]:
display(df)

  payment_method  receita_total
0           None     78246545.0
1         boleto      8552491.0
2        crédito      7109102.0
3       dinheiro     10210131.0
4         débito      6367515.0
5            pix     10563267.0